simulation_inputs/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
131374
(
(44.2 1.65929e-08 0)
(44.2 -1.46488e-07 0)
(44.2 -5.22707e-07 0)
(44.2 -9.33782e-07 0)
(44.2 -1.38179e-06 0)
(44.2 -1.86848e-06 0)
(44.2 -2.3952e-06 0)
(44.2 -2.9628e-06 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (44.2 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            noSlip;
    }
    lowerWall
    {
        type            noSlip;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
